MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/edc/PIC32MX795F512H.PIC
      <edc:SFRDef edc:_addr="0x1F8810E0" edc:_begin="0x0" edc:_end="0x160" edc:_modsrc="DOS-01166_TDAA_int_evic.Module" edc:_refcount="1" edc:access="-----------nnnnn---nnnnn---nnnnn" edc:cname="IPC5" edc:desc="" edc:grp="INT" edc:impl="0xe0ffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------00000---00000---00000" edc:name="IPC5" edc:nzwidth="0x20" edc:por="-----------00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="T5IS" edc:desc="" edc:mask="0x3" edc:name="T5IS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="T5IP" edc:desc="" edc:mask="0x7" edc:name="T5IP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="IC5IS" edc:desc="" edc:mask="0x3" edc:name="IC5IS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="IC5IP" edc:desc="" edc:mask="0x7" edc:name="IC5IP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="OC5IS" edc:desc="" edc:mask="0x3" edc:name="OC5IS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="OC5IP" edc:desc="" edc:mask="0x7" edc:name="OC5IP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8810F0" edc:_begin="0x0" edc:_end="0x160" edc:_modsrc="DOS-01166_TDAA_int_evic.Module" edc:_refcount="1" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC6" edc:desc="" edc:grp="INT" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC6" edc:nzwidth="0x20" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="U1IS" edc:desc="" edc:mask="0x3" edc:name="U1IS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="U1IP" edc:desc="" edc:mask="0x7" edc:name="U1IP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="I2C1IS" edc:desc="" edc:mask="0x3" edc:name="I2C1IS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="I2C1IP" edc:desc="" edc:mask="0x7" edc:name="I2C1IP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="CNIS" edc:desc="" edc:mask="0x3" edc:name="CNIS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="CNIP" edc:desc="" edc:mask="0x7" edc:name="CNIP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1IS" edc:desc="" edc:mask="0x3" edc:name="AD1IS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="AD1IP" edc:desc="" edc:mask="0x7" edc:name="AD1IP" edc:nzwidth="0x3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="U1AIS" edc:desc="" edc:mask="0x1" edc:name="U1AIS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="U1AIP" edc:desc="" edc:mask="0x1" edc:name="U1AIP" edc:nzwidth="0x3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.1">
            <edc:SFRFieldDef edc:cname="SPI3IS" edc:desc="" edc:mask="0x1" edc:name="SPI1AIS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="SPI3IP" edc:desc="" edc:mask="0x1" edc:name="SPI1AIP" edc:nzwidth="0x3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.2">
            <edc:SFRFieldDef edc:cname="SPI1AIS" edc:desc="" edc:mask="0x1" edc:name="SPI1AIS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="SPI1AIP" edc:desc="" edc:mask="0x1" edc:name="SPI1AIP" edc:nzwidth="0x3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.3">
            <edc:SFRFieldDef edc:cname="I2C3IS" edc:desc="" edc:mask="0x1" edc:name="I2C1AIS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="I2C3IP" edc:desc="" edc:mask="0x1" edc:name="I2C1AIP" edc:nzwidth="0x3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.4">
            <edc:SFRFieldDef edc:cname="I2C1AIS" edc:desc="" edc:mask="0x1" edc:name="I2C1AIS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="I2C1AIP" edc:desc="" edc:mask="0x1" edc:name="I2C1AIP" edc:nzwidth="0x3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.5">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F881100" edc:_begin="0x0" edc:_end="0x160" edc:_modsrc="DOS-01166_TDAA_int_evic.Module" edc:_refcount="1" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC7" edc:desc="" edc:grp="INT" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC7" edc:nzwidth="0x20" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PMPIS" edc:desc="" edc:mask="0x3" edc:name="PMPIS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="PMPIP" edc:desc="" edc:mask="0x7" edc:name="PMPIP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="CMP1IS" edc:desc="" edc:mask="0x3" edc:name="CMP1IS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="CMP1IP" edc:desc="" edc:mask="0x7" edc:name="CMP1IP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="CMP2IS" edc:desc="" edc:mask="0x3" edc:name="CMP2IS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="CMP2IP" edc:desc="" edc:mask="0x7" edc:name="CMP2IP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="U3IS" edc:desc="" edc:mask="0x3" edc:name="U3IS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="U3IP" edc:desc="" edc:mask="0x7" edc:name="U3IP" edc:nzwidth="0x3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:AdjustPoint edc:offset="0x18"/>
            <edc:SFRFieldDef edc:cname="U2AIS" edc:desc="" edc:mask="0x1" edc:name="U2AIS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="U2AIP" edc:desc="" edc:mask="0x1" edc:name="U2AIP" edc:nzwidth="0x3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.1">
            <edc:AdjustPoint edc:offset="0x18"/>
            <edc:SFRFieldDef edc:cname="SPI2IS" edc:desc="" edc:mask="0x1" edc:name="SPI2IS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="SPI2IP" edc:desc="" edc:mask="0x1" edc:name="SPI2IP" edc:nzwidth="0x3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.2">
            <edc:AdjustPoint edc:offset="0x18"/>
            <edc:SFRFieldDef edc:cname="SPI2AIS" edc:desc="" edc:mask="0x1" edc:name="SPI2AIS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="SPI2AIP" edc:desc="" edc:mask="0x1" edc:name="SPI2AIP" edc:nzwidth="0x3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.3">
            <edc:AdjustPoint edc:offset="0x18"/>
            <edc:SFRFieldDef edc:cname="I2C4IS" edc:desc="" edc:mask="0x1" edc:name="I2C4IS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="I2C4IP" edc:desc="" edc:mask="0x1" edc:name="I2C4IP" edc:nzwidth="0x3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.4">
            <edc:AdjustPoint edc:offset="0x18"/>
            <edc:SFRFieldDef edc:cname="I2C2AIS" edc:desc="" edc:mask="0x1" edc:name="I2C2AIS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="I2C2AIP" edc:desc="" edc:mask="0x1" edc:name="I2C2AIP" edc:nzwidth="0x3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.5">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F881110" edc:_begin="0x0" edc:_end="0x160" edc:_modsrc="DOS-01166_TDAA_int_evic.Module" edc:_refcount="1" edc:access="---nnnnn---nnnnn-----------nnnnn" edc:cname="IPC8" edc:desc="" edc:grp="INT" edc:impl="0xffffe0ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000-----------00000" edc:name="IPC8" edc:nzwidth="0x20" edc:por="---00000---00000-----------00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="U2IS" edc:desc="" edc:mask="0x3" edc:name="U2IS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="U2IP" edc:desc="" edc:mask="0x7" edc:name="U2IP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="FSCMIS" edc:desc="" edc:mask="0x3" edc:name="FSCMIS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="FSCMIP" edc:desc="" edc:mask="0x7" edc:name="FSCMIP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="RTCCIS" edc:desc="" edc:mask="0x3" edc:name="RTCCIS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="RTCCIP" edc:desc="" edc:mask="0x7" edc:name="RTCCIP" edc:nzwidth="0x3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="U3AIS" edc:desc="" edc:mask="0x1" edc:name="U3AIS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="U3AIP" edc:desc="" edc:mask="0x1" edc:name="U3AIP" edc:nzwidth="0x3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.1">
            <edc:SFRFieldDef edc:cname="SPI4IS" edc:desc="" edc:mask="0x1" edc:name="SPI4IS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="SPI4IP" edc:desc="" edc:mask="0x1" edc:name="SPI4IP" edc:nzwidth="0x3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.2">
            <edc:SFRFieldDef edc:cname="SPI3AIS" edc:desc="" edc:mask="0x1" edc:name="SPI3AIS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="SPI3AIP" edc:desc="" edc:mask="0x1" edc:name="SPI3AIP" edc:nzwidth="0x3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.3">
            <edc:SFRFieldDef edc:cname="I2C5IS" edc:desc="" edc:mask="0x1" edc:name="I2C5IS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="I2C5IP" edc:desc="" edc:mask="0x1" edc:name="I2C5IP" edc:nzwidth="0x3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.4">
            <edc:SFRFieldDef edc:cname="I2C3AIS" edc:desc="" edc:mask="0x1" edc:name="I2C3AIS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="I2C3AIP" edc:desc="" edc:mask="0x1" edc:name="I2C3AIP" edc:nzwidth="0x3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.5">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
